[
    {
        "title": "MMA News UFC Fight News, Videos & Pictures | BJPenn.com",
        "url": "https://www.bjpenn.com/mma-news/",
        "content": "x x MMA News UFC ONE Championship News RIZIN FF News Bellator News VIDEOS BJ Penn Tutorials BJ Penn Vlogs Exclusives RADIO Search | BJPenn.com MMA News UFC ONE Championship News RIZIN FF News Bellator News VIDEOS BJ Penn Tutorials BJ Penn Vlogs Exclusives RADIO Sign in Welcome! Log into your account your username your password Forgot your password? Get help Privacy Policy Password recovery Recover your password your email A password will be e-mailed to you. advertisement - continue reading below advertisement - continue reading below Home » MMA News MMA News BJPenn.com is your trusted source for the latest MMA breaking news, results and fight videos. Gabe Green wants Daniel Rodriguez rematch, confident the fight would go differently: “I do think I beat him nine out of 10 times” Cole Shelton - May 6, 2022 PFL 3 Results: Anthony Pettis stops Myles Price in Round 1 (Video) Chris Taylor - May 6, 2022 PFL 3 Results: Rory MacDonald stops Brett Cooper in Round 1 (Video) Justin Gaethje reacts to alleged “scale gate” at the UFC 274 weigh-ins Bellator 280 Results: Ryan Bader defeats Cheick Kongo (Highlights) Charles Oliveira issues statement after being stripped of his lightweight title for missing weight at UFC 274 Grant Dawson says Jared Gordon fight was a “picture-perfect performance,” wants Diego Ferreira next Bellator 280 Results: Yoel Romero TKO’s Alex Polizzi (Video) Bellator Chris Taylor - May 6, 2022 Today's Bellator 280 event is co-headlined by a light heavyweight bout between Yoel Romero and Alex Polizzi.\nRomero (13-6 MMA) will be looking to snap... UFC releases official statement regarding stipulations for Charles Oliveira vs. Justin Gaethje fight: “If... Charles Oliveira Cole Shelton - May 6, 2022 Charles Oliveira will still be fighting for UFC gold should he beat Justin Gaethje at UFC 274.\nOliveira was looking to defend his belt for... Justin Gaethje reacts to Jorge Masvidal’s alleged attack on Colby Covington: “That was a... UFC Susan Cox - May 6, 2022 Justin Gaethje is sharing his thoughts on Jorge Masvidal's alleged attack on Colby Covington.\nIt was at UFC 272 on March 5th of this year... Pro fighters react after Charles Oliveira is stripped of lightweight title for missing weight... Charles Oliveira Christopher Taylor - May 6, 2022 Several pro fighters have reacted after Charles Oliveira was stripped of his lightweight title for missing weight at UFC 274.\nOliveira (32-8 MMA) was set... advertisement - continue reading below advertisement - continue reading below UFC 274 Weigh-In Results: Charles Oliveira misses weight on first attempt, has 1 hour... UFC Susan Cox - May 6, 2022 The UFC 274 fighter weigh-ins kick off at noon ET today, May 6th at the UFC host hotel in Phoenix, Arizona.\nUFC 274 takes place... Shu-Ki Fita #18: KL.42 Shu-Ki Fita Chris Taylor - May 6, 2022 INTRODUCING KL.42\nKL.42 is a HYBRID model built with Air Jordan IX’s, Air Jordan XXII’s, Air Jordan XIII’s, and Air Jordan X’s. Its construction is TOE-DOWN... Justin Gaethje says Colby Covington sucks to watch but admits he’s a great fighter:... Colby Covington Susan Cox - May 6, 2022 Justin Gaethje believes it sucks to watch Colby Covington but does admit he's a great fighter.\nIt will be Justin Gaethje vs. Charles Oliveira at... Paddy Pimblett reveals his favorite MMA fighter of all time Paddy Pimblett Susan Cox - May 6, 2022 Paddy Pimblett has revealed his favorite MMA fighter of all time.\nPaddy the 'Baddy' is an upcoming star in the UFC, but his MMA career... advertisement - continue reading below advertisement - continue reading below Islam Makhachev shares bold prediction for potential Charles Oliveira fight Charles Oliveira Harry Kettle - May 6, 2022 UFC lightweight Islam Makhachev has made a bold prediction for a potential fight against Charles Oliveira.\nWhile Charles Oliveira may be focusing his attention on... Brandon Jenkins reacts after being released by the UFC: “Something I worked hard for... UFC Harry Kettle - May 6, 2022 Brandon Jenkins has released a statement after it was announced that he had been let go by the Ultimate Fighting Championship.\nIt's not uncommon for... Photos | Michael Chandler is insanely shredded for his UFC 274 fight with Tony... Michael Chandler Harry Kettle - May 6, 2022 UFC star Michael Chandler is in the shape of his life heading into his UFC 274 fight against Tony Ferguson tomorrow night.\nWhile there may... Donald Cerrone reveals he didn’t want to be in the Octagon at UFC 246:... Conor McGregor Harry Kettle - May 6, 2022 UFC veteran Donald Cerrone has revealed he didn't want to be in the Octagon with Conor McGregor when they fought at UFC 246.\nThis Saturday... advertisement - continue reading below advertisement - continue reading below Fernie Garcia says he “couldn’t ask for a better opponent” for his debut in... Exclusive MMA Interviews Cole Shelton - May 5, 2022 Fernie Garcia thought he would get to the UFC much sooner than this.\nGarcia, a Fortis MMA fighter, started out his career 5-0 and got... Loopy Godinez wants to be as active as possible, eyes stoppage win over Ariane... Exclusive MMA Interviews Cole Shelton - May 5, 2022 Loopy Godinez didn't think she would be on the sidelines for this long.\nGodinez made her UFC debut on short notice and came up short... Tony Ferguson rips Dustin Poirier for saying he wants to fight him: “He’s full... Dustin Poirier Cole Shelton - May 5, 2022 Tony Ferguson doesn't think Dustin Poirier actually wants to fight him.\nWith Ferguson fighting Michael Chandler at UFC 274, Poirier said on social media it's... Shu-Ki Fita #17: SH.36 Shu-Ki Fita Chris Taylor - May 5, 2022 INTRODUCING SH.36\nSH.36 is a HYBRID model built with Air Jordan IX’s, Air Jordan XVII’s, Air Jordan XIV’s, and Air Jordan I’s. Its construction is TOE-UP... advertisement - continue reading below advertisement - continue reading below Donald Cerrone says he’s fighting for “legacy” now: “I don’t have to worry about... Donald Cowboy Cerrone Cole Shelton - May 5, 2022 Donald Cerrone says he's fighting for himself and his legacy now and doesn't care what anyone thinks about him.\nCerrone is set to return to... Rose Namajunas says praise from Mike Tyson is the “coolest thing” that’s happened on... Mike Tyson Susan Cox - May 5, 2022 Rose Namajunas is saying that the praise she received from Mike Tyson is the 'coolest thing' that's happened to her on her MMA journey.\nIt... Alexander Volkanovski vs. Max Holloway 3 set for UFC 276 Alex Volkanovski Cole Shelton - May 5, 2022 Alexander Volkanovski and Max Holloway will finally be having their trilogy match.\nAccording to MMAJunkie, which was first mentioned by Ariel Helwani, Volkanovski vs. Holloway... UFC 274 | Pro fighters make their picks for Michael Chandler vs. Tony Ferguson Exclusive MMA Interviews Cole Shelton - May 5, 2022 On the main card of UFC 274, an intriguing lightweight bout takes place as Michael Chandler takes on Tony Ferguson. Heading into the fight,... advertisement - continue reading below advertisement - continue reading below Chael Sonnen on the UFC attempting to book Nate Diaz vs. Khamzat Chimaev: “Adesanya... Chael Sonnen Susan Cox - May 5, 2022 Chael Sonnen is weighing in on the UFC attempting to book Nate Diaz vs. Khamzat Chimaev.\nUFC President, Dana White, recently did an interview in... Paddy Pimblett scoffs at the idea of fighting four times a year in the... Paddy Pimblett Susan Cox - May 5, 2022 Paddy Pimblett has scoffed at the idea of fighting four times a year in the UFC.\nPimblett, (18-3 MMA), the up and coming British sensation... Conor McGregor blasts Tony Ferguson for his comments about Dana White and the UFC Conor McGregor Susan Cox - May 5, 2022 Conor McGregor is blasting Tony Ferguson for his comments about Dana White and the UFC.\nTony Ferguson, (26-6 MMA) is scheduled to battle it out... Terrance McKinney offers to provide Dave Chappelle with security following recent attack Terrance McKinney Harry Kettle - May 5, 2022 UFC star Terrance McKinney has offered his support to Dave Chappelle after the comedian was attacked recently.\nEarlier this week, popular comedian Dave Chappelle was... advertisement - continue reading below advertisement - continue reading below Luke Rockhold vs. Paulo Costa and Thiago Santos vs. Jamahal Hill slated for August... Jamahal Hill Harry Kettle - May 5, 2022 The UFC is planning two blockbuster light heavyweight showdowns for August - Luke Rockhold vs Paulo Costa and Thiago Santos vs Jamahal Hill.\nThe 205-pound... Yoel Romero has one stipulation for a potential fight with Bellator champion Gegard Mousasi Bellator Harry Kettle - May 5, 2022 Yoel Romero is interested in taking on Gegard Mousasi in Bellator - but only if the middleweight championship is on the line.\nWhile he may... UFC champion Aljamain Sterling praises Sean O’Malley for his “genius” approach to the fight... Aljamain Sterling Harry Kettle - May 5, 2022 UFC bantamweight champion Aljamain Sterling has praised Sean O'Malley for his approach to the fight game.\nWhile neither man is overly popular within the general... Justin Gaethje responds to recent criticism from Nate Diaz: “I heard he turned down... Justin Gaethje Christopher Taylor - May 4, 2022 Justin Gaethje has responded to the recent criticism he received from Nate Diaz regarding his loss to Khabib Nurmagomedov.\nGaethje (23-3 MMA) is set to... Load more BJPENN.COM is your premier source for all MMA News. We serve you with the latest breaking news, exclusive fighter interviews, videos and more. It is also the home of 2X UFC Hall of Fame Champion. BJ \"The Prodigy\" Penn. After a decade of on-line operation BJP has evolved into the most reliable destination for all of your MMA needs. MMA News UFC ONE Championship News RIZIN FF News Bellator News VIDEOS BJ Penn Tutorials BJ Penn Vlogs Exclusives RADIO Get in Touch contact@bjpenn.com Advertise advertise@bjpenn.com © 2022 BJ Penn Enterprises Privacy Policy"
    },
    {
        "title": "UFC | BJ Penn",
        "url": "https://www.bjpenn.com/ufc-news/",
        "content": "x x MMA News UFC ONE Championship News RIZIN FF News Bellator News VIDEOS BJ Penn Tutorials BJ Penn Vlogs Exclusives RADIO Search | BJPenn.com MMA News UFC ONE Championship News RIZIN FF News Bellator News VIDEOS BJ Penn Tutorials BJ Penn Vlogs Exclusives RADIO Sign in Welcome! Log into your account your username your password Forgot your password? Get help Privacy Policy Password recovery Recover your password your email A password will be e-mailed to you. advertisement - continue reading below advertisement - continue reading below Home » UFC UFC NEWS UFC News from UFC (Ultimate Fighting Championship) is a Mixed Martial Arts (MMA) organization based in the United States Rose Namajunas issues statement on social media, Ronda Rousey and Joanna Jedrzejczyk send messages of support Christopher Taylor - May 8, 2022 Dana White reacts to “weird fight” between Rose Namajunas and Carla Esparza at UFC 274 Tony Ferguson discharged from Phoenix hospital following scary KO loss at UFC 274 Dana White reacts to recent criticism from former UFC middleweight champion Anderson Silva Rose Namajunas reacts to backlash following title loss to Carla Esparza at UFC 274 UFC News Khabib Nurmagomedov weighs in on Charles Oliveira’s submission victory over Justin Gaethje at UFC... Dana White Fernando Quiles - May 8, 2022 UFC Hall of Fame inductee Khabib Nurmagomedov wants the world's top MMA promotion to cut to the chase with Islam Makhachev.\nOn May 7, Charles... Dana White reacts to Michael Chandler knocking out Tony Ferguson at UFC 274 Dana White Fernando Quiles - May 8, 2022 UFC President Dana White has given his take on Michael Chandler's scintillating knockout win over Tony Ferguson.\nWhen Chandler vs. Ferguson was first announced, fans... Justin Gaethje reacts following submission loss to Charles Oliveira at UFC 274 Charles Oliveira Fernando Quiles - May 8, 2022 Justin Gaethje has sent out a brief message of gratitude after falling short against Charles Oliveira.\nLast night (May 7), UFC 274 took place inside... UFC 274 Bonus Report: Michael Chandler pockets $50k for his KO of Tony Ferguson Justin Gaethje Chris Taylor - May 7, 2022 The Octagon returned to Phoenix for tonight's UFC 274 event, a fifteen-bout fight card headlined by Charles Oliveira vs. Justin Gaethje.\nThe highly anticipated lightweight... Conor McGregor responds to callout from Charles Oliveira Charles Oliveira Chris Taylor - May 7, 2022 Conor McGregor has responded after receiving a challenge from UFC 274 main event winner Charles Oliveira.\nOliveira (33-8 MMA) squared off with Justin Gaethje (22-4... Load more Exclusive Interviews UFC 274 | Pro fighters make their picks for Rose Namajunas vs. Carla Esparza... Carla Esparza Cole Shelton - May 4, 2022 In the co-main event of UFC 274 Rose Namajunas is looking to defend her strawweight title as she rematches Carla Esparza after seven-and-a-half years.... Brandon Royval plans to have “chaotic” fight against Matt Schnell at UFC 274: “I’m... Brandon Royval Cole Shelton - May 3, 2022 Brandon Royval is ecstatic he will finally get to fight in front of fans again.\nRoyval is set for his sixth Octagon appearance against Matt Schnell at... Joe Lauzon plans to blitz Donald Cerrone early in what could be his final... Donald Cowboy Cerrone Cole Shelton - May 3, 2022 Joe Lauzon will make the walk to the Octagon for the first time since October 2019 on Saturday night.\nLauzon is set to open up... Blagoy Ivanov plans to be better than ever when he competes for the first... Blagoy Ivanov Cole Shelton - May 2, 2022 Blagoy Ivanov will finally be making the walk to the Octagon again.\nIvanov is set to face Marcos Rogerio de Lima on Saturday at UFC... Load more BJPENN.COM is your premier source for all MMA News. We serve you with the latest breaking news, exclusive fighter interviews, videos and more. It is also the home of 2X UFC Hall of Fame Champion. BJ \"The Prodigy\" Penn. After a decade of on-line operation BJP has evolved into the most reliable destination for all of your MMA needs. MMA News UFC ONE Championship News RIZIN FF News Bellator News VIDEOS BJ Penn Tutorials BJ Penn Vlogs Exclusives RADIO Get in Touch contact@bjpenn.com Advertise advertise@bjpenn.com © 2022 BJ Penn Enterprises Privacy Policy"
    }
]